package com.itmaoo.scenic.robot.nuke.cilei;
/**
 * 语气助词（语气词）通常位于在句中或者句末，表示描述（说话）时的语气或者状态。在表示复杂语气的时候，可以使用多种语气词来表示，如“啊，你真聪明呀！”。相同的语气词有时根据前后文、语境的不同，也有各种不同的意思，如“你真厉害啊！”（赞扬），“你真是厉害啊！”（批评，反语）。所以，语气词没有实义，也不能单独使用。
常见的语气词有以下这些分类：疑问语气、祈使语气、感叹语气、肯定语气和停顿语气。
疑问语气：“吗（么）、吧、呢”或文言中的“也、者、乎、哉、与、欤、邪（耶）、为”等等。某些情况下，当“啊”读升调时，也表疑问语气。不同的疑问语气词，表示的疑问程度也不尽相同，“呢”和“吧”疑问程序较“吗”来的要小，通常表示（推测出答案）征求意见。
祈使语气：“吧、罢、呀、啊、啦”或文言中的“矣、焉、哉”等等，表示命令、请求、劝告、督促等语气，例如：“不要在这里吸烟好吧”。
感叹语气：“啊、呀、哇、哪”或文言中的“也、矣、乎、焉、哉、与、欤、已”，表示输出主观的感情色彩。注意，感叹语气词和叹词不同，叹词通常用于句首，而感叹语气词一般用于句末且不能独立使用。
肯定语气：“的、了、嘛、呢、啦、罢了、而已”或文言中的“也、矣、乎、然、焉、耳、而已、云、尔”。有些肯定语气词，如“罢了”、“而已”，有时带有主观的感情色彩。注意，肯定语气词与结构助词不同，结构助词若去掉便会影响句子的结构，而语气词去掉则无伤大雅。
停顿语气：“啊、吧、呢、么”或文言中的“也、矣、乎、焉、兮”，一般用于句中，有停顿、强调突出前方词语的功能。
时态助词
时态助词也称动态助词，通常接在动词或形容词后，表动作或变化的状态，可与时间副词连用。白话文中常见的时态助词有“着、了、过”，文言文中有“矣”。但“矣”字通常兼有语气助词的功用。
结构助词
结构助词附着在词、词组的前面或后面，用以表示句子的结构关系。常见的结构助词有前缀的“所”，以及后附的“的、地、得、似的”等等。而文言中则有“之、者、所、然、夫、所以、乎、焉、等、且”等等。
 * @author mario
 *
 */
public enum ZhuCi {
	YuQi,ShiTai,JieGou
}
